# Exercise 2
Add the specified code for each code cell, running the cells _in order_.

Run the below cell to import `pandas` and `numpy`

In [6]:
import pandas as pd
import numpy as np

Create a Series of 100 employees **`names`** ("Employee 1", "Employee 2", ... "Employee 100"). _Tip:_ use a list comprehension to produce the list of strings by concatenating "Employee" with the numbers from a range.
- Use the `head()` and `tail()` methods to print the first and last 3 employees to check your work.

In [32]:
names = ["Employee"+str(loop) for loop in range(1,101)] #list comprehension
names_Series = pd.Series(names)
print(len(names_Series))

100

Create a Series of 100 random salaries for the year 2016. These should be uniformly distributed between 40000 and 50000. _Hint:_ try using the [**numpy.random.uniform()**](https://docs.scipy.org/doc/numpy/reference/generated/numpy.random.uniform.html) function, or call the Python `random.uniform()` function repeatedly.
- This is not a liveable wage in Seattle, and in fact is below US median :(

In [29]:
# import random
# salaries = [random.uniform(40000,50000) for i in range(1,100)]
# print(salaries)
salaries_2016 = np.random.uniform(40000,50000,100)
print(len(salaries_2016))

100

Create a Series of 100 salaries in 2017 that have changed from 2016 by a random amount between -5000 and 10000.

In [30]:
salaries_change = np.random.uniform(-5000,10000,100)
salaries_2017 =salaries_2016+salaries_change
print(len(salaries_2017))

100

Create a DataFrame **`salaries`** by combining the three Series you just made (employee names, 2016 salaries, and 2017 salaries).

In [33]:
salaries = pd.DataFrame({'name':names_Series,
                        'salary2016':salaries_2016,
                        'salary2017':salaries_2017})

Print the first 10 rows in the `salaries` DataFrame.

In [74]:
salaries.loc[0:9]
salaries.head(10)

         name    salary2016    salary2017       change  got_raise
0   Employee1  46357.433908  46514.219183   156.785275       True
1   Employee2  45418.980868  49830.230895  4411.250027       True
2   Employee3  45748.034308  44055.819482 -1692.214826      False
3   Employee4  45490.173089  48266.782099  2776.609011       True
4   Employee5  40210.984600  46887.779898  6676.795298       True
5   Employee6  48221.876736  47000.890603 -1220.986133      False
6   Employee7  41221.170702  39428.172459 -1792.998244      False
7   Employee8  43441.124053  44011.828034   570.703981       True
8   Employee9  49617.283860  49447.891735  -169.392125      False
9  Employee10  43113.446826  44027.407309   913.960483       True

Add a column **`change`** to your DataFrame that contains the difference in salary between 2017 and 2016.

In [41]:
change = salaries_2017- salaries_2016
salaries['change'] = change
salaries

           name    salary2016    salary2017       change
0     Employee1  46357.433908  46514.219183   156.785275
1     Employee2  45418.980868  49830.230895  4411.250027
2     Employee3  45748.034308  44055.819482 -1692.214826
3     Employee4  45490.173089  48266.782099  2776.609011
4     Employee5  40210.984600  46887.779898  6676.795298
..          ...           ...           ...          ...
95   Employee96  44563.129490  40488.384226 -4074.745264
96   Employee97  46607.164485  45408.889927 -1198.274558
97   Employee98  40273.006191  42721.069668  2448.063478
98   Employee99  48349.205041  51278.855085  2929.650044
99  Employee100  42947.844864  52822.215909  9874.371044

[100 rows x 4 columns]

Add a column **`got_raise`** to your DataFrame that is `True` if the employee got a raise (their salary increased) in 2017.

In [44]:
got_raise = change > 0
salaries['got_raise'] = got_raise
salaries

           name    salary2016    salary2017       change  got_raise
0     Employee1  46357.433908  46514.219183   156.785275       True
1     Employee2  45418.980868  49830.230895  4411.250027       True
2     Employee3  45748.034308  44055.819482 -1692.214826      False
3     Employee4  45490.173089  48266.782099  2776.609011       True
4     Employee5  40210.984600  46887.779898  6676.795298       True
..          ...           ...           ...          ...        ...
95   Employee96  44563.129490  40488.384226 -4074.745264      False
96   Employee97  46607.164485  45408.889927 -1198.274558      False
97   Employee98  40273.006191  42721.069668  2448.063478       True
98   Employee99  48349.205041  51278.855085  2929.650044       True
99  Employee100  42947.844864  52822.215909  9874.371044       True

[100 rows x 5 columns]

**Retrieve values from the `salaries` DataFrame to answer the following questions. Try to get as specific a value as possible (e.g., a single value rather than the whole row!)**

What was the 2017 salary of Employee 57?

In [51]:
salaries.iloc[56]['salary2017']

44556.136849084985

How many employees got a raise? (It should be around 2/3rds)

In [59]:
len(salaries[salaries.got_raise])

66

What was the amount of the largest raise?

In [60]:
salaries.change.max()

9963.175927152777

What was the "name" of the employee who received the highest raise?

In [62]:
salaries[change == 9963.175927152777]

          name    salary2016   salary2017       change  got_raise
70  Employee71  44608.436563  54571.61249  9963.175927       True

What is the name and 2017 salary of the person who received the largest payment (decrease in salary) between the two years?

In [80]:
#salaries[change == salaries['change'].max()]['name']
salaries.loc[salaries.change == salaries.change.min(),['name','salary2017']]
#salaries.loc[salaries.change == salaries.change.min(), ['employee','salary_2017']].iloc[0]

          name    salary2017
43  Employee44  36801.046806